In [1]:
import numpy as np
import pandas as pd
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a','b','c','d', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to write a DataFrame to CSV file using tab separator

In [2]:
df.to_csv('latihan.csv', sep = '\t', index=False)
latihan_df = pd.read_csv('latihan.csv')
latihan_df

  name\tscore\tattempts\tqualify
0        Anastasia\t12.5\t1\tyes
1               Dima\t9.0\t3\tno
2        Katherine\t16.5\t2\tyes
3                 James\t\t3\tno
4              Emily\t9.0\t2\tno
5          Michael\t20.0\t3\tyes
6          Matthew\t14.5\t1\tyes
7                 Laura\t\t1\tno
8              Kevin\t8.0\t2\tno
9            Jonas\t19.0\t1\tyes

Write a Pandas program to widen output display to see more columns.

In [3]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to select a row of series/dataframe by given integer index

In [4]:
result = df.iloc[[2]]
result

        name  score  attempts qualify
c  Katherine   16.5         2     yes

Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [5]:
df = df.fillna(1)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    1.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    1.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to count the NaN values in one or more columns in DataFrame

In [6]:
print(df.isnull().values.sum())

0

Write a Pandas program to drop a list of rows from a specified DataFrame

In [7]:
df = df.drop(df.index[[2,4]])
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
d      James    1.0         3      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    1.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to reset index in a given DataFrame

In [8]:
df = df.reset_index()
df = df[["name","score","attempts","qualify"]]
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2      James    1.0         3      no
3    Michael   20.0         3     yes
4    Matthew   14.5         1     yes
5      Laura    1.0         1      no
6      Kevin    8.0         2      no
7      Jonas   19.0         1     yes

Write a Pandas program to devide a DataFrame in a given ratio

In [9]:
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)
print("\n70% of the said DataFrame:")
print(part_70)
print("\n30% of the said DataFrame:")
print(part_30)

70% of the said DataFrame:
        name  score  attempts qualify
2      James    1.0         3      no
3    Michael   20.0         3     yes
6      Kevin    8.0         2      no
7      Jonas   19.0         1     yes
0  Anastasia   12.5         1     yes
4    Matthew   14.5         1     yes

30% of the said DataFrame:
    name  score  attempts qualify
1   Dima    9.0         3      no
5  Laura    1.0         1      no